# Create Database
Author: Nian Vrey

## Setup

### Imports

In [1]:
#Imports
import pandas as pd
import json

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

import tkinter as tk
from tkinter import filedialog

import warnings
warnings.simplefilter("ignore")

### Key Variables

In [2]:
# Key Variables
data_folder = 'Data/'
dbname = 'movies'

In [3]:
# Get DB Username and Password
root = tk.Tk()
root.withdraw()
keys_path = filedialog.askopenfilename()

with open(keys_path, 'r') as f:
    login = json.load(f)
username = login['username']
password = login['password']

### Create DataFrames

In [4]:
# Create DataFrames
#df_akas = pd.read_csv(f'{data_folder}title_akas.csv.gz')
df_title_basics = pd.read_csv(f'{data_folder}title_basics.csv.gz')
df_title_ratings = pd.read_csv(f'{data_folder}title_ratings.csv.gz')
df_tmdb_data = pd.read_csv(f'{data_folder}tmdb_results_combined.csv.gz')

In [5]:
#df_akas.head()

In [6]:
df_title_basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008,NaN,94,Horror

In [7]:
df_title_ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      2002
1  tt0000002            5.8       269
2  tt0000005            6.2      2678
3  tt0000006            5.0       182
4  tt0000007            5.4       838

In [8]:
df_tmdb_data.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0312305,0.0,/lqUbt2cy2pnqvxKefbQAtxLS0WA.jpg,NaN,0.0,"[{'id': 10751, 'name': 'Family'}, {'id': 16, '...",http://www.qqthemovie.com/,23738.0,en,Quantum Quest: A Cassini Space Odyssey,...,0.0,45.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Quantum Quest: A Cassini Space Odyssey,0.0,7.900,8.0,NaN
2,tt0326965,0.0,/xt2klJdKCVGXcoBGQrGfAS0aGDE.jpg,NaN,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 9648, ...",http://www.inmysleep.com,40048.0,en,In My Sleep,...,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Sleepwalking can be deadly.,In My Sleep,0.0,5.318,33.0,PG-13
3,tt0331312,0.0,NaN,NaN,0.0,[],NaN,214026.0,en,This Wretched Life,...,0.0,0.0,[],Released,NaN,This Wretched Life,0.0,5.000,1.0,NaN
4,tt0393049,0.0,/gc9FN5zohhzCt05RkejQIIPLtBl.jpg,NaN,300000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",NaN,324352.0,en,Anderson's Cross,...,0.0,98.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Sometimes the boy next door is more than the b...,Anderson's Cross,0.0,4.000,5.0,NaN

## Clean DataFrames

### Rename Columns

In [9]:
rename_dict = {'tconst': 'movie_id',
              'primaryTitle':'primary_title',
              'startYear':'start_year',
              'runtimeMinutes':'runtime',
              'averageRating':'average_rating', 
               'numVotes':'num_votes',
              'imdb_id':'movie_id'}

In [10]:
df_title_basics.rename(rename_dict, axis=1, inplace=True)

In [11]:
df_title_ratings.rename(rename_dict, axis=1, inplace=True)

In [12]:
df_tmdb_data.rename(rename_dict, axis=1, inplace=True)

### Normalize Genre

In [13]:
df_title_basics.head()

,movie_id,titleType,primary_title,originalTitle,isAdult,start_year,endYear,runtime,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0068865,movie,Lives of Performers,Lives of Performers,0,2016,NaN,90,Drama
3,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
4,tt0082328,movie,Embodiment of Evil,Encarnação do Demônio,0,2008,NaN,94,Horror

In [14]:
df_title_basics['genres_split'] = df_title_basics['genres'].str.split(',')
df_exploded_genres = df_title_basics.explode('genres_split')
unique_genres = sorted(df_exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [15]:
df_title_genres = df_exploded_genres[['movie_id','genres_split']].copy()
df_title_genres.head()

    movie_id genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

In [16]:
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [17]:
df_title_genres.head()

    movie_id genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0068865        Drama

In [18]:
df_title_genres['genre_id'] = df_title_genres['genres_split'].map(genre_map)

In [19]:
df_genres = pd.DataFrame({'genre_name':genre_map.keys(),
                          'genre_id':genre_map.values()})

In [20]:
df_genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### Discard Unnecessary Information

In [21]:
df_title_basics = df_title_basics.drop(columns=['titleType','originalTitle','isAdult','genres','genres_split','endYear'])
df_title_basics.columns

Index(['movie_id', 'primary_title', 'start_year', 'runtime'], dtype='object')

In [22]:
df_title_ratings.columns

Index(['movie_id', 'average_rating', 'num_votes'], dtype='object')

In [23]:
df_title_genres = df_title_genres.drop(columns=['genres_split'])
df_title_genres.columns

Index(['movie_id', 'genre_id'], dtype='object')

In [24]:
df_genres.columns

Index(['genre_name', 'genre_id'], dtype='object')

In [25]:
df_tmdb_data = df_tmdb_data.drop(columns=['adult', 'backdrop_path', 'belongs_to_collection', 
                                          'genres', 'homepage', 'id', 'original_language', 'original_title',
                                          'overview', 'popularity', 'poster_path', 'production_companies',
                                          'spoken_languages', 'status', 'tagline', 'title', 'video',
                                          'vote_average', 'vote_count','production_countries', 'runtime','release_date',])
df_tmdb_data.columns

Index(['movie_id', 'budget', 'revenue', 'certification'], dtype='object')

In [26]:
# Useless 0's to drop
df_tmdb_data.drop(df_tmdb_data[df_tmdb_data['movie_id']=='0'].index, inplace=True)

### Setup Tables - DataFrames

In [27]:
# Merge the title DataFrames for normalization purposes
df_title = pd.merge(left=df_title_basics, right=df_title_ratings, left_on='movie_id', right_on='movie_id')
df_title

,movie_id,primary_title,start_year,runtime,average_rating,num_votes
0,tt0035423,Kate & Leopold,2001,118,6.4,87747
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,6.4,181
2,tt0068865,Lives of Performers,2016,90,5.4,74
3,tt0069049,The Other Side of the Wind,2018,122,6.7,7853
4,tt0082328,Embodiment of Evil,2008,94,5.9,1753
...,...,...,...,...,...,...
68337,tt9914942,Life Without Sara Amat,2019,74,6.6,182
68338,tt9915872,The Last White Witch,2019,97,6.4,9
68339,tt9916170,The Rehearsal,2019,51,7.0,7
68340,tt9916190,Safeguard,2020,95,3.7,244
68341,tt9916362,Coven,2020,92,6.4,5571

In [28]:
# Check Column Types
print(df_title.dtypes,
      df_title_genres.dtypes,
      df_genres.dtypes,
      df_tmdb_data.dtypes, 
      sep='\n\n')

movie_id           object
primary_title      object
start_year          int64
runtime             int64
average_rating    float64
num_votes           int64
dtype: object

movie_id    object
genre_id     int64
dtype: object

genre_name    object
genre_id       int64
dtype: object

movie_id          object
budget           float64
revenue          float64
certification     object
dtype: object

In [29]:
len_movie_id = df_title_basics['movie_id'].fillna('').map(len).max()
len_primary_title = df_title_basics['primary_title'].fillna('').map(len).max()
len_genre_name = df_genres['genre_name'].fillna('').map(len).max()
len_certification = df_tmdb_data['certification'].fillna('').map(len).max()

In [30]:
df_schema = {'movie_id': String(len_movie_id+1),
             'primary_title':Text(len_primary_title+1),
             'start_year':Integer(),
             'runtime':Integer(),
             'average_rating':Float(),
             'num_votes':Integer(),
             'genre_id':Integer(),
             'genre_name':Text(len_genre_name+1),
             'budget':Float(),
             'revenue':Float(),
             'certification':Text(len_primary_title+1)
             }

### Create Database Connection

In [31]:
# Database Connection
conn_str = f'mysql+pymysql://{username}:{password}@localhost/{dbname}'
conn = create_engine(conn_str)

In [32]:
if not database_exists(conn_str):
    create_database(conn_str)
    print("Database Created")

In [33]:
# Create Tables
df_title.to_sql('titles', conn, dtype=df_schema, if_exists='replace', index=False)
df_title_genres.to_sql('title_genres', conn, dtype=df_schema, if_exists='replace', index=False)
df_genres.to_sql('genres', conn, dtype=df_schema, if_exists='replace', index=False)
df_tmdb_data.to_sql('tmdb_data', conn, dtype=df_schema, if_exists='replace', index=False)

38568

In [34]:
sql = "SELECT * FROM titles LIMIT 5;"
pd.read_sql(sql, conn)

,movie_id,primary_title,start_year,runtime,average_rating,num_votes
0,tt0035423,Kate & Leopold,2001,118,6.4,87747
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70,6.4,181
2,tt0068865,Lives of Performers,2016,90,5.4,74
3,tt0069049,The Other Side of the Wind,2018,122,6.7,7853
4,tt0082328,Embodiment of Evil,2008,94,5.9,1753

In [35]:
sql = "SELECT * FROM title_genres LIMIT 5;"
pd.read_sql(sql, conn)

    movie_id  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0068865         7

In [36]:
sql = "SELECT * FROM genres LIMIT 5;"
pd.read_sql(sql, conn)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [37]:
sql = "SELECT * FROM tmdb_data LIMIT 5;"
pd.read_sql(sql, conn)

    movie_id       budget      revenue certification
0  tt0312305          0.0          0.0          None
1  tt0326965          0.0          0.0         PG-13
2  tt0331312          0.0          0.0          None
3  tt0393049     300000.0          0.0          None
4  tt0398286  260000000.0  592462000.0            PG

In [38]:
# Add Primary and Foreign Key Constraints
conn.execute('ALTER TABLE titles ADD PRIMARY KEY (`movie_id`);')
conn.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')
conn.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`movie_id`);')

In [39]:
sql = "SHOW TABLES;"
pd.read_sql(sql, conn)

  Tables_in_movies
0           genres
1     title_genres
2           titles
3        tmdb_data